[Character.CharClass_DeathTrap AIClassDefinition]
DefaultDisplayName=""
UBMKilledByMessageString=""

[Misc.ReviveMessage_DeathTrapRes GenericReviveMessageDefinition]
Message_Self="Armadilha mortal lhe ajudou em %s. Não precisa agradecer."
Message_Other="Obrigado, Armadilha Mortal!"

[Skills.Skill_AttackMode_MovementSpeed SkillDefinition]
SkillName="Modo de Ataque - Velocidade de Movimento"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_DefenseMode_SelfRepair SkillDefinition]
SkillName="Autorreparação"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_LaserSweep_OnDeathtrap SkillDefinition]
SkillName=""
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_ShieldBoost_Player SkillDefinition]
SkillName="Sonda-Potencializadora-Escudo"
SkillDescription="Sonda telepática que recarrega seus escudos"
LockedSkillDetailStr="<Locked>"

[Skills.Skill_ShockBall_Status SkillDefinition]
SkillName=""
SkillDescription=""
LockedSkillDetailStr="<Locked>"

